Autodesk.Revit.DB.RenderingImageExposureSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.RenderingImageExposureSettings.Saturation
The value of rendering image saturation.
Remarks:
Increase this value to get more intense colors.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value of saturation is not valid. The valid range is 0 to 5.
Since:
2013

Autodesk.Revit.DB.RenderingImageExposureSettings.WhitePoint
The white point value.
Remarks:
Specify the white balance of the rendering(measured in Kelvin). Incandescent lighting:2800 K; Daylight 6500K.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value of white point is not valid. The valid range is 1800 to 15000.
Since:
2013

Autodesk.Revit.DB.RenderingImageExposureSettings.Shadows
The shadows value.
Remarks:
Increase this value to get darker shadows.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value of shadows is not valid. The valid range is 0.1 to 4.
Since:
2013

Autodesk.Revit.DB.RenderingImageExposureSettings.Highlights
The highlights value.
Remarks:
Increase this value to get brighter highlights.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value of highlights is not valid. The valid range is 0 to 1.
Since:
2013

Autodesk.Revit.DB.RenderingImageExposureSettings.ExposureValue
The value of rendering image exposure.
Remarks:
Default exposure value based on Lighting Scheme.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value of rendering image exposure is not valid. The valid range is 0 to 21.
Since:
2013

Autodesk.Revit.DB.RenderingImageExposureSettings
Represents the exposure settings of rendering.
Since:
2013